src/InformationRegisters/ОшибкиЗагрузкиОП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиЗагрузкиОП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>document_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСвязи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОшибкиЗагрузкиОП/Ext/ManagerModule.bsl
Функция ПолучитьМетаданные()
	Возврат Метаданные.РегистрыСведений.ОшибкиЗагрузкиОП;
КонецФункции

Функция ВыгрузитьЭлементы(вхМассивНомеровДокументов, вхПланОбмена) Экспорт
	
	Результат = Новый Массив;
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ВыгрузитьЭлементы]: неправильный параметр номер 2.";
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_ОкноПоставщика) тогда
		
		лМенеджерПланаОбмена = ПланыОбмена[лМетаданныеПланаОбмена.Имя];
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивНомеровДокументов", вхМассивНомеровДокументов);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОшибкиЗагрузкиОП.НомерДокумента КАК invoice_id,
		               |	ОшибкиЗагрузкиОП.КлючСвязи КАК order_no,
		               |	ОшибкиЗагрузкиОП.ОписаниеОшибки КАК error,
		               |	ОшибкиЗагрузкиОП.document_date,
		               |	ОшибкиЗагрузкиОП.number,
		               |	""error"" КАК status
		               |ИЗ
		               |	РегистрСведений.ОшибкиЗагрузкиОП КАК ОшибкиЗагрузкиОП
		               |ГДЕ
		               |	ОшибкиЗагрузкиОП.НомерДокумента В(&МассивНомеровДокументов)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	order_no
		               |ИТОГИ ПО
		               |	invoice_id";
		ВыборкаПоНомерамДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		лТипОбъектаXDTO = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ПоступлениеТоваровУслуг_Ошибка");
		
		Пока ВыборкаПоНомерамДокументов.Следующий() Цикл
			
			лОбъект = ФабрикаXDTO.Создать(лТипОбъектаXDTO);
			
			лОбъект.invoice_id = ВыборкаПоНомерамДокументов.invoice_id;
			
			лТипОшибкиСтроки = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ПоступлениеТоваровУслуг_Ошибка_Строки");
			лОбъектОшибкиСтроки = ФабрикаXDTO.Создать(лТипОшибкиСтроки);
			лСписокОбъектов = лОбъектОшибкиСтроки.ПолучитьСписок("item");
			
			лТипОшибкиСтрока = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ПоступлениеТоваровУслуг_Ошибка_Строка");
			
			Выборка = ВыборкаПоНомерамДокументов.Выбрать();
			
			ПервыйПроход = Истина;
			
			Пока Выборка.Следующий() Цикл
				
				Если ПервыйПроход Тогда
					ПервыйПроход = Ложь;
					ЗаполнитьЗначенияСвойств(лОбъект, Выборка);
					лОбъект.doc_date = Формат(Выборка.document_date, "ДФ=yyyy-MM-dd");
					лОбъект.doc_time = Формат(Выборка.document_date, "ДФ=hh:mm");
					Если Не ЗначениеЗаполнено(лОбъект.error) Тогда
						
						лОбъект.error = "Во время обработки СФ обнаружены ошибки";
						
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				лОбъектОшибкиСтрока = ФабрикаXDTO.Создать(лТипОшибкиСтрока);
				ЗаполнитьЗначенияСвойств(лОбъектОшибкиСтрока, Выборка);
				лОбъектОшибкиСтрока.invoice_number = лОбъект.number;
				
				лСписокОбъектов.Добавить(лОбъектОшибкиСтрока);
				
			КонецЦикла;
			
			лОбъект.items = лОбъектОшибкиСтроки;
			
			Результат.Добавить(лОбъект);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
